In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [3]:
slg_70_75 = pd.read_csv('1970-75.csv')
df = pd.DataFrame()

slg = slg_70_75.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_70_75 = df
slg_70_75.head()

     SLG
0  0.371

In [4]:
slg_76_80 = pd.read_csv('1976-80.csv')
df = pd.DataFrame()

slg = slg_76_80.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_76_80 = df
slg_76_80.head()

      SLG
0  0.3852

In [5]:
slg_81_85= pd.read_csv('1981-85.csv')
df = pd.DataFrame()

slg = slg_81_85.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_81_85 = df
slg_81_85.head()

      SLG
0  0.3846

In [6]:
slg_86_90= pd.read_csv('1986-90.csv')
df = pd.DataFrame()

slg = slg_86_90.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_86_90 = df
slg_86_90.head()

      SLG
0  0.3896

In [7]:
slg_91_95= pd.read_csv('1991-95.csv')
df = pd.DataFrame()

slg = slg_91_95.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_91_95 = df
slg_91_95.head()

      SLG
0  0.4012

In [8]:
slg_96_00= pd.read_csv('1996-00.csv')
df = pd.DataFrame()

slg = slg_96_00.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_96_00 = df
slg_96_00.head()

      SLG
0  0.4274

In [9]:
slg_01_05= pd.read_csv('2001-05.csv')
df = pd.DataFrame()

slg = slg_01_05.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_01_05 = df
slg_01_05.head()

      SLG
0  0.4226

In [11]:
slg_06_10= pd.read_csv('2006-10.csv')
df = pd.DataFrame()

slg = slg_06_10.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_06_10 = df
slg_06_10.head()

      SLG
0  0.4184

In [12]:
slg_11_15= pd.read_csv('2011-15.csv')
df = pd.DataFrame()

slg = slg_11_15.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_11_15 = df
slg_11_15.head()

      SLG
0  0.3982

In [13]:
slg_16_21= pd.read_csv('2016-21.csv')
df = pd.DataFrame()

slg = slg_16_21.SLG

df.insert(0, 'SLG', slg)
df.SLG = df.SLG.mean()
df = df.drop(df.index.to_list()[1:], axis = 0)

slg_16_21 = df
slg_16_21.head()

        SLG
0  0.419333

In [15]:
slg_data = pd.concat([slg_70_75, slg_76_80, slg_81_85, slg_86_90, slg_91_95, slg_96_00, slg_01_05, slg_06_10, slg_11_15, slg_16_21])

In [16]:
len(slg_data)

10

In [17]:
test_slg_data = slg_data

In [18]:
test_slg_data

        SLG
0  0.371000
0  0.385200
0  0.384600
0  0.389600
0  0.401200
0  0.427400
0  0.422600
0  0.418400
0  0.398200
0  0.419333

In [19]:
years = ['1970-1975', '1976-1980', '1981-1985', '1986-1990', '1991-1995', '1996-2000', '2001-2005', '2006-2010', '2011-2015', '2016-2021']

In [20]:
test_slg_data.insert(0, 'Years', years)

In [21]:
test_slg_data

       Years       SLG
0  1970-1975  0.371000
0  1976-1980  0.385200
0  1981-1985  0.384600
0  1986-1990  0.389600
0  1991-1995  0.401200
0  1996-2000  0.427400
0  2001-2005  0.422600
0  2006-2010  0.418400
0  2011-2015  0.398200
0  2016-2021  0.419333

In [23]:
test_slg_data.set_index('Years')

                SLG
Years
1970-1975  0.371000
1976-1980  0.385200
1981-1985  0.384600
1986-1990  0.389600
1991-1995  0.401200
1996-2000  0.427400
2001-2005  0.422600
2006-2010  0.418400
2011-2015  0.398200
2016-2021  0.419333

In [24]:
test_slg_data = test_slg_data.reset_index(drop=True)

In [25]:
test_slg_data

       Years       SLG
0  1970-1975  0.371000
1  1976-1980  0.385200
2  1981-1985  0.384600
3  1986-1990  0.389600
4  1991-1995  0.401200
5  1996-2000  0.427400
6  2001-2005  0.422600
7  2006-2010  0.418400
8  2011-2015  0.398200
9  2016-2021  0.419333

In [26]:
test_slg_data.set_index('Years', inplace=True)

In [27]:
test_slg_data

                SLG
Years
1970-1975  0.371000
1976-1980  0.385200
1981-1985  0.384600
1986-1990  0.389600
1991-1995  0.401200
1996-2000  0.427400
2001-2005  0.422600
2006-2010  0.418400
2011-2015  0.398200
2016-2021  0.419333

In [28]:
slg_data = test_slg_data

In [30]:
test_slg_data = test_slg_data.astype('str')
test_slg_data.SLG = test_slg_data.SLG.str[:5]

In [31]:
test_slg_data

             SLG
Years
1970-1975  0.371
1976-1980  0.385
1981-1985  0.384
1986-1990  0.389
1991-1995  0.401
1996-2000  0.427
2001-2005  0.422
2006-2010  0.418
2011-2015  0.398
2016-2021  0.419

In [32]:
slg_data = test_slg_data

In [33]:
slg_data

             SLG
Years
1970-1975  0.371
1976-1980  0.385
1981-1985  0.384
1986-1990  0.389
1991-1995  0.401
1996-2000  0.427
2001-2005  0.422
2006-2010  0.418
2011-2015  0.398
2016-2021  0.419

In [29]:
slg_data.to_csv('slg_data.csv')